experiments/experiment-normal/k6-100vus.log
time="2025-03-16T19:56:25-05:00" level=info msg="Status: 200 OK" source=console
time="2025-03-16T19:56:25-05:00" level=info msg="Status: 200 OK" source=console
time="2025-03-16T19:56:26-05:00" level=info msg="Status: 200 OK" source=console
time="2025-03-16T19:56:26-05:00" level=info msg="Status: 200 OK" source=console
time="2025-03-16T19:56:27-05:00" level=info msg="Status: 200 OK" source=console
time="2025-03-16T19:56:27-05:00" level=info msg="Status: 200 OK" source=console
time="2025-03-16T19:56:27-05:00" level=info msg="Status: 200 OK" source=console
[...]
time="2025-03-16T19:56:28-05:00" level=info msg="Status: 200 OK" source=console
time="2025-03-16T19:56:28-05:00" level=info msg="Status: 200 OK" source=console
time="2025-03-16T19:56:32-05:00" level=info msg="Status: 200 OK" source=console
time="2025-03-16T19:56:33-05:00" level=info msg="Status: 200 OK" source=console
time="2025-03-16T19:56:34-05:00" level=info msg="Status: 200 OK" source=console
time="2025-03-16T19:56:35-05:00" level=info msg="Status: 200 OK" source=console
time="2025-03-16T19:56:37-05:00" level=info msg="Status: 200 OK" source=console
time="2025-03-16T19:56:37-05:00" level=info msg="Status: 200 OK" source=console
time="2025-03-16T19:56:37-05:00" level=info msg="Status: 200 OK" source=console
time="2025-03-16T19:56:38-05:00" level=info msg="Status: 200 OK" source=console
time="2025-03-16T19:56:42-05:00" level=info msg="Status: 200 OK" source=console
time="2025-03-16T19:56:42-05:00" level=info msg="Status: 200 OK" source=console
time="2025-03-16T19:56:42-05:00" level=info msg="Status: 200 OK" source=console
time="2025-03-16T19:56:43-05:00" level=info msg="Status: 200 OK" source=console
time="2025-03-16T19:56:44-05:00" level=info msg="Status: 200 OK" source=console
time="2025-03-16T19:56:44-05:00" level=info msg="Status: 200 OK" source=console
time="2025-03-16T19:56:46-05:00" level=info msg="Status: 200 OK" source=console
time="2025-03-16T19:56:46-05:00" level=info msg="Status: 200 OK" source=console
time="2025-03-16T19:56:48-05:00" level=info msg="Status: 200 OK" source=console
time="2025-03-16T19:56:48-05:00" level=info msg="Status: 200 OK" source=console
time="2025-03-16T19:56:50-05:00" level=info msg="Status: 200 OK" source=console
time="2025-03-16T19:56:51-05:00" level=info msg="Status: 200 OK" source=console
time="2025-03-16T19:56:51-05:00" level=info msg="Status: 200 OK" source=console
time="2025-03-16T19:56:51-05:00" level=info msg="Status: 200 OK" source=console
time="2025-03-16T19:56:52-05:00" level=info msg="Status: 200 OK" source=console
time="2025-03-16T19:56:56-05:00" level=info msg="Status: 200 OK" source=console
time="2025-03-16T19:56:57-05:00" level=info msg="Status: 200 OK" source=console
time="2025-03-16T19:56:58-05:00" level=info msg="Status: 200 OK" source=console
time="2025-03-16T19:56:58-05:00" level=info msg="Status: 200 OK" source=console
time="2025-03-16T19:56:59-05:00" level=info msg="Status: 200 OK" source=console
time="2025-03-16T19:57:01-05:00" level=info msg="Status: 200 OK" source=console
time="2025-03-16T19:57:02-05:00" level=info msg="Status: 200 OK" source=console
time="2025-03-16T19:57:04-05:00" level=info msg="Status: 200 OK" source=console
time="2025-03-16T19:57:06-05:00" level=info msg="Status: 200 OK" source=console
time="2025-03-16T19:57:07-05:00" level=info msg="Status: 200 OK" source=console
time="2025-03-16T19:57:09-05:00" level=info msg="Status: 200 OK" source=console
time="2025-03-16T19:57:09-05:00" level=info msg="Status: 200 OK" source=console

     data_received..................: 7.8 kB 174 B/s
     data_sent......................: 16 kB  351 B/s
   ✓ failures.......................: 0.00%  0 out of 45
     http_req_blocked...............: avg=131.9ms  min=113.15ms med=120.94ms max=184.06ms p(90)=181.73ms p(95)=182.72ms
     http_req_connecting............: avg=130.22ms min=111.73ms med=119.39ms max=182.23ms p(90)=179.65ms p(95)=180.86ms
     http_req_duration..............: avg=19.51s   min=158.54ms med=19.21s   max=44.19s   p(90)=38.37s   p(95)=41.92s  
       { expected_response:true }...: avg=19.51s   min=158.54ms med=19.21s   max=44.19s   p(90)=38.37s   p(95)=41.92s  
     http_req_failed................: 0.00%  0 out of 45
     http_req_receiving.............: avg=246.68µs min=43µs     med=252µs    max=708µs    p(90)=364µs    p(95)=443.59µs
     http_req_sending...............: avg=34.51µs  min=13µs     med=22µs     max=161µs    p(90)=63.8µs   p(95)=118.19µs
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=19.51s   min=158.25ms med=19.21s   max=44.19s   p(90)=38.37s   p(95)=41.92s  
     http_reqs......................: 45     0.999782/s
     iteration_duration.............: avg=19.64s   min=273.51ms med=19.34s   max=44.33s   p(90)=38.54s   p(95)=42.1s   
     iterations.....................: 45     0.999782/s
     vus............................: 73     min=73      max=100
     vus_max........................: 100    min=100     max=100