experiments/experiment-normal/k6-20vus.log
time="2025-03-16T19:55:41-05:00" level=info msg="Status: 200 OK" source=console
time="2025-03-16T19:55:43-05:00" level=info msg="Status: 200 OK" source=console
time="2025-03-16T19:55:44-05:00" level=info msg="Status: 200 OK" source=console
time="2025-03-16T19:55:45-05:00" level=info msg="Status: 200 OK" source=console
time="2025-03-16T19:55:45-05:00" level=info msg="Status: 200 OK" source=console
time="2025-03-16T19:55:45-05:00" level=info msg="Status: 200 OK" source=console
[...]
time="2025-03-16T19:55:47-05:00" level=info msg="Status: 200 OK" source=console
time="2025-03-16T19:55:47-05:00" level=info msg="Status: 200 OK" source=console
time="2025-03-16T19:55:49-05:00" level=info msg="Status: 200 OK" source=console
time="2025-03-16T19:55:49-05:00" level=info msg="Status: 200 OK" source=console
time="2025-03-16T19:55:49-05:00" level=info msg="Status: 200 OK" source=console
time="2025-03-16T19:55:50-05:00" level=info msg="Status: 200 OK" source=console
time="2025-03-16T19:55:51-05:00" level=info msg="Status: 200 OK" source=console
time="2025-03-16T19:55:51-05:00" level=info msg="Status: 200 OK" source=console
time="2025-03-16T19:55:56-05:00" level=info msg="Status: 200 OK" source=console
time="2025-03-16T19:55:56-05:00" level=info msg="Status: 200 OK" source=console
time="2025-03-16T19:55:56-05:00" level=info msg="Status: 200 OK" source=console
time="2025-03-16T19:56:00-05:00" level=info msg="Status: 200 OK" source=console
time="2025-03-16T19:56:04-05:00" level=info msg="Status: 200 OK" source=console
time="2025-03-16T19:56:07-05:00" level=info msg="Status: 200 OK" source=console

     data_received..................: 3.8 kB 146 B/s
     data_sent......................: 2.9 kB 112 B/s
   ✓ failures.......................: 0.00%  0 out of 22
     http_req_blocked...............: avg=96.43ms  min=12µs     med=107.5ms  max=113.54ms p(90)=112.35ms p(95)=112.52ms
     http_req_connecting............: avg=94.94ms  min=0s       med=105.83ms max=111.86ms p(90)=110.66ms p(95)=110.79ms
     http_req_duration..............: avg=9.24s    min=100.34ms med=8.13s    max=23.9s    p(90)=18.78s   p(95)=22.82s  
       { expected_response:true }...: avg=9.24s    min=100.34ms med=8.13s    max=23.9s    p(90)=18.78s   p(95)=22.82s  
     http_req_failed................: 0.00%  0 out of 22
     http_req_receiving.............: avg=263.36µs min=56µs     med=216.5µs  max=880µs    p(90)=483.9µs  p(95)=551.75µs
     http_req_sending...............: avg=29.4µs   min=13µs     med=27.5µs   max=69µs     p(90)=39.6µs   p(95)=57.09µs 
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=9.24s    min=99.43ms  med=8.13s    max=23.9s    p(90)=18.78s   p(95)=22.82s  
     http_reqs......................: 22     0.839079/s
     iteration_duration.............: avg=9.34s    min=199.56ms med=8.24s    max=23.9s    p(90)=18.89s   p(95)=22.82s  
     iterations.....................: 22     0.839079/s
     vus............................: 1      min=1       max=20
     vus_max........................: 20     min=20      max=20